Setup-tensorHVAC-Pro/master/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    floor
    {
        type            zeroGradient;
    }

    ceiling
    {
        type            zeroGradient;
    }



    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    wall
    {
        type            zeroGradient;
    }

    object_1
    {
        type            zeroGradient;
    }

        inlet_1
    {
        type            fixedValue;
        value           uniform 290;
    }

   wind
    {
        type            fixedValue;
        value           uniform 302;
    }
}


// ***************************************************************** //
// *********************** tensorHVAC-2025 ************************* //
// ************************ tensorhvac.com ************************* //