Setup-tensorHVAC-Pro/master/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    floor
    {
        type            noSlip;
    }

    ceiling
    {
        type            noSlip;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0.1 0 0);
    }

    wall
    {
        type            noSlip;
    }

    object_1
    {
        type            noSlip;
    }

        inlet_1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    wind
    {
        type        inletOutlet;
        inletValue  uniform (1 0 -0.2);   // used only when inflow occurs
        value       uniform (0 0 0);   // required dummy
    }
}

// ***************************************************************** //
// *********************** tensorHVAC-2025 ************************* //
// ************************ tensorhvac.com ************************* //