Setup-tensorHVAC-Pro/master/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    floor
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }

    ceiling
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }

    inlet_1
    {
        type            calculated;
        value           $internalField;
    }

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    wall
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }
    object_1
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }

    wind
    {
        type  calculated;
        value $internalField;
    }

}


// ***************************************************************** //
// *********************** tensorHVAC-2025 ************************* //
// ************************ tensorhvac.com ************************* //