Setup-tensorHVAC-Pro/master/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.001350;

boundaryField
{

    floor
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    ceiling
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    inlet_1
    {
        type            fixedValue;
        value           $internalField;
    }

    wind
    {
        type            fixedValue;
        value           uniform 0.003;
    }


    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    object_1
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ***************************************************************** //
// *********************** tensorHVAC-2025 ************************* //
// ************************ tensorhvac.com ************************* //