Setup-tensorHVAC-Pro/master/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2600;

boundaryField
{
    inlet_1
    {
        type            fixedValue;
        value           uniform 1e-8;
    }

    wind
    {
        type            fixedValue;
        value           uniform 15;
    }
    
    outlet
    {
        type            zeroGradient;
    }

    object_1
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    wall
    {
        type            omegaWallFunction;
        value           $internalField;
    }


   ceiling
    {
        type            omegaWallFunction;
        value           $internalField;
    }


    floor
    {
        type            omegaWallFunction;
        value           $internalField;
    }

}


// ************************************************************************* //
// **************************** tensorXF 2025 ****************************** //
// **************************** pttensor.com ******************************* //