Setup-tensorHVAC-Pro/master/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale    1;

vertices
(
    (0 -0.25 -4)
    (6 -0.25 -4)
    (6 1.5 -4)
    (0 1.5 -4)

    (0 -0.25 0)
    (6 -0.25 0)
    (6 1.5 0)
    (0 1.5 0)

);blocks
(
    hex (0 1 2 3 4 5 6 7) (60 18 40) simpleGrading (1 1 1)
);

defaultPatch
{
    name    wind;
    type    patch;
}

boundary
();

// ***************************************************************** //
// *********************** tensorHVAC-2025 ************************* //
// ************************ tensorhvac.com ************************* //