Setup-tensorHVAC-Pro/master/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver                  GAMG;
        tolerance               1e-8;
        relTol                  0.01;

        // Robust AMG settings
        smoother                GaussSeidel;
        nPreSweeps              2;
        nPostSweeps             2;
        nFinestSweeps           2;

        cacheAgglomeration      true;
        agglomerator            faceAreaPair;
        nCellsInCoarsestLevel   10;
        mergeLevels             1;
        maxCoarseLevels         10;
        scaleCorrection         true;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         2;
        tolerance       1e-7;
        relTol          0.1;
    }

    h
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        nSweeps         2;
        tolerance       1e-7;
        relTol          0.1;
    }

    "(k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-7;
        relTol          0.1;
    }

    age
    {
        $U;
        relTol          0.001;
    }
}

SIMPLE
{
    momentumPredictor          true;
    consistent                 yes;      // stabilizes flux-pressure coupling
    nNonOrthogonalCorrectors   2;

    pRefCell  0;
    pRefValue 0;

    residualControl
    {
        p_rgh           1e-8;
        U               1e-8;
        h               1e-8;
        "(k|epsilon|omega)" 1e-8;
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           0.4;   // tighter than 0.7 for steadier pressure updates
    }

    equations
    {
        U               0.3;
        h               0.3;
        "(k|epsilon|omega|R)" 0.5;
        age             1;
    }
}

// ***************************************************************** //
// *********************** tensorHVAC-2025 ************************* //
// ************************ tensorhvac.com ************************* //
