Setup-tensorHVAC-Pro/master/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


castellatedMesh true;
snap            true;
addLayers      false;


geometry
{
    ceiling.stl { type triSurfaceMesh; name ceiling; }
    floor.stl   { type triSurfaceMesh; name floor; }
    outlet.stl  { type triSurfaceMesh; name outlet; }
    wall_1.stl    { type triSurfaceMesh; name wall_1; }
    inlet_1.stl { type triSurfaceMesh; name inlet_1; }
    object_1.stl { type triSurfaceMesh; name object_1; }
}


castellatedMeshControls
{
    maxLocalCells 200000;
    maxGlobalCells 10000000;
    minRefinementCells 2;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 2;

    features
    (

    );

    refinementSurfaces
    {
        ceiling        { level (0 0); }
        floor        { level (0 0); }
        outlet        { level (0 1); }
        wall        { level (0 0); }
        inlet_1        { level (0 1); }
        object_1       { level (1 1); }
}

    resolveFeatureAngle 2;

    refinementRegions
    {
	refinementBox { mode inside; level 1; }
    }


    locationInMesh (3 0.625 -2);
    allowFreeStandingZoneFaces false;
}



snapControls
{
    nSmoothPatch 3;
    tolerance 4.0;
    nSolveIter 30;
    nRelaxIter 5;
}


addLayersControls
{
    relativeSizes true;
    layers
    {
        naca2412.stl
        {
            nSurfaceLayers 1;
        }
    }

    expansionRatio 1.0;

    finalLayerThickness 0.3;

    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 2;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minFlatness 0.5;
    minVol 1e-13;
    minTetQuality 1e-30;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}

mergeTolerance 1E-6;



// ***************************************************************** //
// *********************** tensorHVAC-2025 ************************* //
// ************************ tensorhvac.com ************************* //
